modules/admin/controllers/ArticleController.php

SELECT * FROM `article` WHERE `id`='18'
---
    protected function findModel($id)
    {
        if (($model = Article::findOne($id)) !== null) {

SELECT * FROM `category`
---
    public function actionSetCategory($id)
    {
        $article = $this->findModel($id);
        $selectedCategory = $article->category->id;
        $categories = ArrayHelper::map(Category::find()->all(), 'id', 'title');