controllers/SiteController.php

    public function actionIndex()
    {
        $data = Article::getAll(5);
        $popular = Article::getPopular();
        $categories = Category::find()->all();
---
SELECT * FROM `category`

    public function actionView($id)
    {
        $article = Article::findOne($id);
        $popular = Article::getPopular();
        $categories = Category::find()->all();
---
SELECT * FROM `article` WHERE `id`='24'
SELECT * FROM `category`