modules/admin/views/comment/index.php

SELECT * FROM `article` WHERE `id`=24
---
                        <td><?= $comment->id?></td>
                        <td><?= $comment->user->name?></td>
                        <td><?= $comment->user->name?></td>
                        <td><?= Article::findOne($comment->article_id)->title?></td>