models/Article.php

SELECT `id` FROM `tag` WHERE `id` IN ('3', '4')
---
    public function saveTags($tags){
        if(is_array($tags)){
            $this->clearCurrentTags();
            foreach ($tags as $tag_id){
                $tag = Tag::findOne($tag_id);

SELECT COUNT(*) FROM `article`
SELECT * FROM `article` LIMIT 10
---
    public static function getAll($pageSize = 5){
        $query = Article::find();
        $count = $query->count();
        $pagination = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $articles = $query
            ->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();

SELECT * FROM `article` ORDER BY `viewed` DESC LIMIT 3
---
    public static function getPopular(){
        return Article::find()->orderBy('viewed desc ')->limit(3)->all();

SELECT * FROM `comment` WHERE (`status`=1) AND (`article_id`=24)
---
    public function getArticleComments()
    {
        return $this->getComments()->where(['status'=>1])->all();

UPDATE `article` SET `viewed`=18 WHERE `id`=24
---
    public function viewedCounter()
    {
        $this->viewed += 1;
        return $this->save(false);