models/Category.php

    public function getArticlesCount(){
        return $this->getArticles()->count();
---
SELECT COUNT(*) FROM `article` WHERE `category_id`=2