models/User.php

SELECT * FROM `user` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        // TODO: Implement findIdentity() method.
        return User::findOne($id);